/*
 * NoGray JavaScript Library v1.0
 * http://www.NoGray.com
 *
 * Copyright (c) 2009 Wesam Saif
 * http://www.nogray.com/license.php
 */

ng.Language.set_language('ar', {
	direction: 'rtl',
	
	numbers: ['٠','١','٢','٣','٤','٥','٦','٧','٨','٩'],
	numbers_ordinal: ['', '', '', ''], //['st', 'nd', 'rd', 'th'],
	
	date: {
		days:{
			'char':['أحد','اثنين','ثلاثاء','أربعاء','خميس','جمعة','سبت'],
			short:['أحد','اثنين','ثلاثاء','أربعاء','خميس','جمعة','سبت'],
			mid:['أحد','اثنين','ثلاثاء','أربعاء','خميس','جمعة','سبت'],
			'long':['الأحد','الاثنين','الثلاثاء','الأربعاء','الخميس','الجمعة','السبت']
		},
		months:{
			short:['يناير','فبراير','مارس','أبريل','مايو','يونيو','يوليو','أغسطس','سبتمبر','أكتوبر','نوفمبر','ديسمبر'],
			'long':['يناير','فبراير','مارس','أبريل','مايو','يونيو','يوليو','أغسطس','سبتمبر','أكتوبر','نوفمبر','ديسمبر']
		},
		am_pm:{
			lowercase:['صباحا','مساء'],
			uppercase:['صباحا','مساء']
		}	
	},
	
	yes: 'نعم',
	no: 'لا',
	
	'open': 'إفتح',
	'close': 'إغلاق',
	clear: 'إفرغ'
});
